# 作者： 世界第一大帅哥
# 开发时间 2022/1/4 20:34

# 除法运算、整除运算与取余（模）运算
print(11 / 2)     # 5.5
print(11 // 2)    # 5
print(11 % 2)     # 1

# 整除与取模之间的关系
a = 11 // 2       # a=5
b = 11 % 2        # b=1
print(2*a+b)      # c=2*5+1=11

# 幂运算
print(2**3)  # 表示2的3次方，即2*2*2=8

# 正数整除正数、负数整除负数、正数整除负数、负数整除正数
# 重点：一正一负向下取整
print(9 // 4)      # 2
print(-9 // -4)    # 2
print(9 // -4)     # -3
print(-9 // 4)     # -3

# 正数整除正数、负数整除负数、正数取余负数、负数取余正数
# 求余数的数学公式：余数 = 被除数 - 除数 * 商
print(9 % 4)       # 1
print(-9 % -4)     # -1
print(9 % -4)      # -3
print(-9 % 4)      # 3

# 与C或C++不一样，Python中没有x++、++x这类写法
